{
  "architectures": [
    "MT5ForConditionalGeneration"
  ],
  "classifier_dropout": 0.0,
  "d_ff": 512,
  "d_kv": 64,
  "d_model": 256,
  "decoder_start_token_id": 2,
  "decoder_vocab_size": 822,
  "dense_act_fn": "gelu_new",
  "dropout_rate": 0.1,
  "encoder_vocab_size": 138,
  "eos_token_id": 1,
  "feed_forward_proj": "gated-gelu",
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "is_gated_act": true,
  "layer_norm_epsilon": 1e-06,
  "model_type": "mt5",
  "num_decoder_layers": 4,
  "num_heads": 3,
  "num_layers": 4,
  "pad_token_id": 0,
  "relative_attention_max_distance": 128,
  "relative_attention_num_buckets": 32,
  "shared_embedding": false,
  "tie_word_embeddings": false,
  "tokenizer_class": "T5Tokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.37.1",
  "use_cache": true
}
